import { IoArrowBackCircleSharp } from "react-icons/io5";
import { Link } from "react-router-dom";

function Elderly() {
  return (
    <main>
      <section className="m-4 mb-12 md:mb-8">
        <button>
          <Link
            to="/health-awareness"
            className="flex items-center gap-4 bg-white shadow-2xl rounded-[30px] px-6 py-2 md:gap-8"
          >
            <IoArrowBackCircleSharp size={40} className="text-emerald-700" />
            <p className="text-emerald-800 md:text-[25px]">الرجوع</p>
          </Link>
        </button>
      </section>
      <div className="flex flex-col justify-center items-center mb-8">
        <h1 className="text-emerald-800 text-[38px]">رعاية المسنين</h1>
        <hr className="border-t-2 border-emerald-800 w-52 mt-2" />
      </div>
      <section className="mb-8">
        <div className="text-right mr-6 md:mr-12">
          <h1 className="text-[28px] text-emerald-800 mb-4 md:text-[38px]">
            :​​​​​​صحة المسنين
          </h1>
          <p className="text-right text-[22px] mb-6 ml-6">
            يعمل كبار السن على تقديم إسهامات عدة للمجتمع عن طريق العمل التطوعي
            ونقل الخبرات والمعرفة للأجيال الأخرى من خلال خبرتهم التي اكتسبوها في
            الحياة، ولمعرفة كمية المساهمات التي يقدمونها يتم الاحتفال عالميًا كل
            عام باليوم العالمي للمسنين أو اليوم العالمي لكبار السن، حيث يتيح
            الفرصة لتسليط الضوء على الإسهامات الكبيرة التي يقدمونها في المجتمع،
            ويرفع مستوى الوعي بالمشاكل والتحديات التي يواجهونها في عالم اليوم،
            والذي يبلغ عددهم (الذين تجاوزوا الستين عامًا) في العالم أكثر من 800
            مليون مُسن، كما يتوقع زيادة العدد لأكثر من بليوني مُسن بحلول عام
            2050م، ويعاني كبار السن مشكلات صحية عدة خاصة بهذه الفئة، فالعديد
            منهم يفقد القدرة على الحركة أو تُصبح حركته محدودة، ويعتمد البعض على
            الآخرين في تلبية حاجاتهم. كما يعاني البعض مشكلات جسدية وعقلية ونفسية
            تتطلب رعاية طبية طويلة الأجل، ومن المهم مساعدة كبار السن، خاصة عند
            ظهور مشكلات نفسية؛ حيث إنهم غالبًا ما يترددون في طلب المساعدة
          </p>
          <h1 className="text-[28px] text-emerald-800 mb-4 md:text-[38px]">
            العوامل الكامنة وراء ظهور المشكلات الصحية النفسية لدى كبار السن
          </h1>
          <p className="text-right text-[22px] mb-6 ml-6">
            هناك العديد من العوامل الاجتماعية والسكانية والنفسية والبيولوجية
            التي تسهم وتؤثر في الحالة الصحية والنفسية للفرد، وتجتمع هذه العوامل
            تقريبًا لدى كبار السن. ومن أمثلتها: الفقر، العزلة الاجتماعية،
            الاعتماد على الآخرين، والشعور بالوحدة، فكل هذه العوامل تؤثر سلبًا في
            صحة ونفسية المسن. يساعد الدعم الاجتماعي والأسري في تعزيز كرامة كبار
            السن ويحد من آثار المشكلات النفسية المترتبة على هذه الفئة، ومن
            الملاحظ زيادة عدد المسنات عن المسنين في العالم، حتى أصبح يطلق عليهم
            (شيخوخة الإناث)، وتختلف المشكلات الصحية والأمراض التي تصيب المسنات
            عن المسنين، كما نجد أن النساء عادة لديهن دخل مادي أقل وعلاقات
            اجتماعية أفضل. ومن جهة أخرى يزيد تعرض النساء للاكتئاب والخرف مقارنة
            مع الرجال
          </p>
          <h1 className="text-[28px] text-emerald-800 mb-4 md:text-[38px]">
            أهم المشكلات النفسية التي يعانيها كبار السن
          </h1>
          <h2 className="text-right text-[25px] font-bold">:الاكتئاب</h2>
          <p className="text-right text-[22px] mb-6 ml-6">
            وهو اضطراب نفسي يختلف تمامًا عن حالات الضيق التي يعانيها كل الناس من
            وقت لآخر؛ حيث إن الإحساس الوقتي بالحزن جزء طبيعي من الحياة. أما في
            حالة الاكتئاب، فإن الإحساس بالحزن لا يتناسب مطلقًا مع أي مؤثر خارجي
            يتعرض له المريض. يقول أطباء الصحة النفسية إن الاكتئاب مرض يؤثر
            بطريقة سلبية في طريقة التفكير والتصرف، ويصيب الذكور، والإناث،
            والصغار، والكبار، والمسنين على حد السواء، فالاكتئاب لا يفرق بين
            مستوى التعليم والثقافة ولا المستوي المادي، فالجميع عرضة للإصابة به
          </p>
          <h1 className="text-[28px] text-emerald-800 mb-4 md:text-[38px]">
            ما الذي يجب فعله عند إحساس المسن بالاكتئاب
          </h1>
          <p className="text-right text-[22px] mb-6 ml-6">
            إذا كانت لديه أعراض الاكتئاب، فمن الضروري أن يحصل على المساعدة،
            وكلما أسرع في الحصول على العلاج كان التحسن أسرع، فبادر دائمًا بزيارة
            الطبيب واشرح له ماذا تشعر، واسأله إذا كنت مصابًا فعلًا بالاكتئاب أم
            لا. قد يقوم الطبيب بإجراء فحوصات عند الحاجة، وقد يقوم أيضًا بمناقشة
            خيارات العلاج المناسبة معك. إن وجود الدعم من الأسرة والأصدقاء يمكن
            أن يكون مريحًا. حاول إيجاد شخص ما للتحدث معه عما يحدث، وإذا كان من
            الصعب عليك التكلم عن أحاسيسك، فيمكنك قضاء وقت مع الأسرة، وبالتأكيد
            ستتغلب على شعورك بالإحباط
          </p>
        </div>
      </section>
    </main>
  );
}

export default Elderly;
